       1 sql-return-codes.
          5 sqlstate               pic x(05).
          5 sqlnativeerror         pic s9(06).
          5 sqlerrormessage        pic x(500).
          5 sqlstatement           pic x(500).
